# St7DeleteLoadPathTemplateHeatSource

Deletes a heat source from the specified load path template.

long St7DeleteLoadPathTemplateHeatSource(long uID, long TemplateID, long Vehicle,

long Pos)

Input Parameters

uID

Strand7 model file ID.

TemplateID

Load path template ID.

Vehicle

Vehicle number.

Pos

Heat source number.